In [1]:
#import Libraries
import ast
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datasets import load_dataset

#Load Dataset
dataset = load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
df['job_skills'] = df['job_skills'].apply(lambda x: ast.literal_eval(x) if pd.notnull(x) else x)

In [ ]:
df_us = df[df['job_country'] == 'United States']

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"[python, c++, java, matlab, aws, tensorflow, k...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
5,Data Engineer,GCP Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia,2023-11-07 14:01:59,False,False,United States,None,NaN,NaN,smart folks inc,"[python, sql, gcp]","{'cloud': ['gcp'], 'programming': ['python', '..."
6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,None,NaN,NaN,"Miracle Software Systems, Inc","[sql, python, java, sql server, gcp, bigquery,...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
9,Data Scientist,Data Scientist II,Anywhere,via ZipRecruiter,Full-time,True,"New York, United States",2023-04-23 13:02:57,False,False,United States,None,NaN,NaN,"Radwell International, LLC","[sql, python, r, mongodb, mongodb, sql server,...","{'analyst_tools': ['excel'], 'cloud': ['azure'..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785673,Data Scientist,Asset Management Data Scientist,"New York, NY",via Trabajo.org,Full-time,False,"New York, United States",2023-10-16 06:01:53,True,False,United States,None,NaN,NaN,JPMorgan Chase & Co.,None,None
785685,Data Analyst,Data Analyst,"Indianapolis, IN",via Trabajo.org,Full-time,False,"Illinois, United States",2023-07-16 06:01:27,True,False,United States,None,NaN,NaN,"Aara Technologies, Inc","[sql, excel]","{'analyst_tools': ['excel'], 'programming': ['..."
785692,Data Scientist,Data Scientist- Hybrid Work Location,"Dayton, OH",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-21 06:02:31,False,True,United States,year,157500.0,NaN,Tenet3,"[python, matlab, r]","{'programming': ['python', 'matlab', 'r']}"
785703,Data Analyst,Data Analyst - CRYPTOGRAPHY - Full-time,Anywhere,via Snagajob,Full-time,True,"Texas, United States",2023-01-28 06:02:55,True,False,United States,None,NaN,NaN,Axelon Services Corporation,None,None
785705,Data Analyst,Expert Business Data Analyst - Now Hiring,"Oakland, CA",via Snagajob,Full-time,False,"California, United States",2023-01-09 06:00:25,False,False,United States,None,NaN,NaN,PG&E Corporation,"[sql, python, tableau]","{'analyst_tools': ['tableau'], 'programming': ..."

In [11]:
df_us_skills=df_us.explode('job_skills')
df_us_skills[['job_title', 'job_skills']]

                                                job_title job_skills
0       Senior Clinical Data Engineer / Principal Clin...       None
3       LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...     python
3       LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...        c++
3       LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...       java
3       LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...     matlab
...                                                   ...        ...
785692               Data Scientist- Hybrid Work Location          r
785703            Data Analyst - CRYPTOGRAPHY - Full-time       None
785705          Expert Business Data Analyst - Now Hiring        sql
785705          Expert Business Data Analyst - Now Hiring     python
785705          Expert Business Data Analyst - Now Hiring    tableau

[1073565 rows x 2 columns]

In [24]:
skills_count = df_us_skills.groupby(['job_skills', 'job_title_short']).size()
df_skills_count = skills_count.reset_index(name= 'count')
df_skills_count.sort_values(by='count', ascending=False, inplace=True)
df_skills_count.head(10)

     job_skills job_title_short  count
1209     python  Data Scientist  42379
1521        sql    Data Analyst  34452
1523        sql  Data Scientist  30034
455       excel    Data Analyst  27519
1243          r  Data Scientist  26022
1522        sql   Data Engineer  23958
1208     python   Data Engineer  22762
1611    tableau    Data Analyst  19311
1207     python    Data Analyst  18382
123         aws   Data Engineer  15018

In [26]:
job_titles = ['Data Analyst', 'Data Scientist', 'Data Engineer']

In [ ]:
job_titles = df_skills_count['job_title_short'].unique().tolist()
job_titles = sorted(job_titles[:3])

In [ ]:
fig, ax = plt.subplots(len(job_titles), 1)
for i, job_title in enumerate(job_titles):
    df_plot = df_skills_count[df_skills_count['job_title_short'] == job_title].head(5)
    df_plot.plot(kind+'barh', x='job_skills', y='count', ax=ax[i], legend=False, color='skyblue')
    ax[i].invert_yaxis()
    ax[i].